#+TITLE: Deploying

The ETL Pipeline is based off the /postgres:12.7-buster/ container image.

* Run as ProwJob
In Prow Config
#+begin_src yaml
periodics:
  - interval: 5m
    agent: kubernetes
    name: asn-data-pipeline
    decorate: true
    spec:
      containers:
        - name: asn-etl-pipeline
          image: asn-etl-pipeline
          command:
            - /usr/local/bin/docker-entrypoint.sh
            - postgres
          imagePullPolicy: Never
          volumeMounts:
            - name: gcp-app-creds
              mountPath: /etc/asn-etl-pipeline
          env:
            - name: POSTGRES_PASSWORD
              value: postgres
            - name: GCP_PROJECT
              value: k8s-infra-ii-sandbox
            - name: GCP_SERVICEACCOUNT
              value: asn-etl@k8s-infra-ii-sandbox.iam.gserviceaccount.com
            - name: GCP_BIGQUERY_DATASET
              value: etl_script_generated_set
            - name: GCP_BIGQUERY_DATASET_LOGS
              value: etl_script_generated_set_prod
            - name: GOOGLE_APPLICATION_CREDENTIALS
              value: /etc/asn-etl-pipeline/asn-etl-pipeline-gcp-sa.json
      volumes:
        - name: gcp-app-creds
          secret:
            secretName: gcp-app-creds
#+end_src

Create the Secret
#+begin_src shell :results silent
kubectl -n prow-workloads create secret generic gcp-app-creds \
    --from-file=asn-etl-pipeline-gcp-sa.json=<(sudo cat /tmp/asn-etl-pipeline-gcp-sa.json) \
    --dry-run=client \
    -o yaml \
    | kubectl apply -f -
#+end_src

Update the local cncf-infra/prow-config/.sharing.io/prow-config-template.yaml with the periodics contents above

Restart Prow Components
#+begin_src shell
kubectl -n prow rollout restart $(kubectl -n prow get deployments -o=jsonpath='{range .items[*]}{.kind}/{.metadata.name} {end}')
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/prow-crier restarted
deployment.apps/prow-deck restarted
deployment.apps/prow-ghproxy restarted
deployment.apps/prow-hook restarted
deployment.apps/prow-horologium restarted
deployment.apps/prow-minio restarted
deployment.apps/prow-plank restarted
deployment.apps/prow-sinker restarted
deployment.apps/prow-statusreconciler restarted
deployment.apps/prow-tide restarted
#+end_example
